; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	image1 - mode
	infrared3 - mode
	infrared0 - mode
	thermograph4 - mode
	thermograph2 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star1 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
)
(:goal (and
	(have_image Phenomenon5 infrared0)
	(have_image Phenomenon6 thermograph4)
	(have_image Phenomenon7 thermograph2)
	(have_image Planet8 infrared3)
	(have_image Planet9 infrared3)
	(have_image Star10 thermograph2)
	(have_image Planet11 thermograph2)
	(have_image Phenomenon12 thermograph4)
	(have_image Phenomenon13 infrared0)
	(have_image Phenomenon14 thermograph2)
	(have_image Phenomenon15 thermograph2)
	(have_image Planet16 image1)
))

)

; plan
1. (turn_to satellite1 groundstation0 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 12
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite1 phenomenon5 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon5)
   goals met: 0 of 12
5. (take_image satellite1 phenomenon5 instrument1 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon13 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 12
7. (turn_to satellite0 groundstation0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 12
8. (take_image satellite1 phenomenon13 instrument1 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 2 of 12
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
10. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 2 of 12
11. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 2 of 12
12. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 12
13. (turn_to satellite0 phenomenon12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 12
14. (take_image satellite0 phenomenon12 instrument0 thermograph4)
   added: (have_image phenomenon12 thermograph4)
   goals met: 3 of 12
15. (turn_to satellite0 phenomenon6 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 12
16. (take_image satellite0 phenomenon6 instrument0 thermograph4)
   added: (have_image phenomenon6 thermograph4)
   goals met: 4 of 12
17. (turn_to satellite0 planet16 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet16)
   goals met: 4 of 12
18. (take_image satellite0 planet16 instrument0 image1)
   added: (have_image planet16 image1)
   goals met: 5 of 12
19. (turn_to satellite0 planet8 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet8)
   goals met: 5 of 12
20. (take_image satellite0 planet8 instrument0 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 6 of 12
21. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 6 of 12
22. (take_image satellite0 planet9 instrument0 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 7 of 12
23. (turn_to satellite1 star1 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star1)
   goals met: 7 of 12
24. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 7 of 12
25. (turn_to satellite1 phenomenon14 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon14)
   goals met: 7 of 12
26. (take_image satellite1 phenomenon14 instrument3 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 8 of 12
27. (turn_to satellite1 phenomenon15 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon15)
   goals met: 8 of 12
28. (take_image satellite1 phenomenon15 instrument3 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 9 of 12
29. (turn_to satellite1 phenomenon7 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon7)
   goals met: 9 of 12
30. (take_image satellite1 phenomenon7 instrument3 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 10 of 12
31. (turn_to satellite1 planet11 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet11)
   goals met: 10 of 12
32. (take_image satellite1 planet11 instrument3 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 11 of 12
33. (turn_to satellite1 star10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star10)
   goals met: 11 of 12
34. (take_image satellite1 star10 instrument3 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 12 of 12
